{
  "HTTP_SUCCESS": 0,
  "HTTP_SERVER_ERROR": "Le serveur a rencontré une erreur interne",
  "HTTP_REQUEST_TIMEOUT": "Erreur réseau",
  "HTTP_BAD_REQUEST": "Votre navigateur a envoyé une requête que ce serveur ne peut pas comprendre",
  "HTTP_UNAUTHORIZED": "Vous n'êtes pas autorisé",
  "HTTP_FORBIDDEN": "Vous n'avez pas l'autorisation d'accéder à cette ressource",
  "HTTP_NOT_FOUND": "Non trouvé",
  "HTTP_UNPROCESSABLE_ENTITY": "Le serveur n'a pas pu traiter la requête",
  "HTTP_TOO_MANY_REQUESTS": "Vous avez effectué trop de requêtes dans un laps de temps donné",
  "HTTP_BAD_GATEWAY": "Le serveur a reçu une réponse invalide d'un serveur en amont lors de la tentative de traitement de la requête",
  "HTTP_GATEWAY_TIMEOUT": "Le serveur, en tant que passerelle ou proxy, n'a pas reçu de réponse en temps opportun de la part du serveur en amont auquel il accédait pour tenter de terminer la requête",
  "MONGODB_DUPLICATE": "L'élément existe déjà",
  "RESOURCE_UPLOAD_IMAGE_ERROR": "Une erreur s'est produite lors du téléchargement de l'image. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "RESOURCE_UPLOAD_NOT_FOUND": "La ressource demandée est introuvable. Veuillez vous assurer que la ressource existe et que l'URL fournie est correcte",
  "CONTENT_MANAGER_UPDATE_ERROR": "Une erreur s'est produite lors de la mise à jour du contenu. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "CONTENT_MANAGER_NOT_FOUND": "Le contenu demandé est introuvable. Veuillez vous assurer que le contenu existe et que l'URL fournie est correcte",
  "DESTINATION_NOT_FOUND": "La destination demandée est introuvable. Veuillez vous assurer que la destination existe et que l'URL fournie est correcte",
  "DESTINATION_UPDATE_ERROR": "Une erreur s'est produite lors de la mise à jour de la destination. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "DESTINATION_DUPLICATION": "Le formulaire est invalide, le point de départ ne peut pas être le point d'arrivée.",
  "STAFF_NOT_FOUND": "Le membre du personnel demandé est introuvable. Veuillez vous assurer que le membre du personnel existe et que l'URL fournie est correcte",
  "STAFF_FROM_GT_TO_TIME": "L'heure de début doit être antérieure à l'heure de fin. Veuillez entrer des heures valides",
  "STAFF_DAYOFF_OUT_RANGE": "Le jour de congé sélectionné est hors de portée. Veuillez sélectionner un jour dans la plage valide",
  "STAFF_MANAGER_EMAIL_DUPLICATE": "L'adresse e-mail existe déjà. Veuillez utiliser une adresse e-mail différente",
  "STAFF_MANAGER_PHONE_DUPLICATE": "Le numéro de téléphone existe déjà. Veuillez utiliser un numéro de téléphone différent",
  "STAFF_UPDATE_INFOMATION_ERROR": "Échec de la mise à jour des informations du personnel. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "VEHICLE_NOT_FOUND": "Le véhicule demandé est introuvable. Veuillez vous assurer que le véhicule existe et que l'URL fournie est correcte",
  "VEHICLE_UPDATE_ERROR": "Échec de la mise à jour des informations du véhicule. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "VEHICLE_EVENT_NOT_FOUND": "L'événement de véhicule demandé est introuvable. Veuillez vous assurer que l'événement de véhicule existe et que l'URL fournie est correcte",
  "VEHICLE_EVENT_UPDATE_ERROR": "Échec de la mise à jour des informations de l'événement de véhicule. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "OFFICE_MANAGER_UPDATE_ERROR": "Échec de la mise à jour des informations du responsable du bureau. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "OFFICE_MANAGER_NOT_FOUND": "Le bureau demandé est introuvable. Veuillez vous assurer que le bureau existe et que l'URL fournie est correcte",
  "OFFICE_MANAGER_EMAIL_DUPLICATE": "Désolé, l'adresse e-mail que vous avez fournie est déjà utilisée",
  "OFFICE_MANAGER_PHONE_DUPLICATE": "Désolé, le numéro de téléphone que vous avez fourni est déjà utilisé",
  "PACKAGE_SETTING_MANAGER_UPDATE_ERROR": "Une erreur s'est produite lors de la mise à jour des paramètres du colis. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "PACKAGE_SETTING_NOT_FOUND": "Les paramètres du colis demandés sont introuvables. Veuillez vous assurer que les paramètres du colis existent et que l'URL fournie est correcte",
  "PACKAGE_SETTING_TITLE_EXISTED": "Le titre des paramètres du colis spécifié existe déjà",
  "SERVICE_SETTING_MANAGER_UPDATE_ERROR": "Une erreur s'est produite lors de la mise à jour des paramètres du service. Veuillez réessayer ou contactez notre équipe de support pour obtenir de l'aide.",
  "SERVICE_SETTING_NOT_FOUND": "Paramètres du service non trouvés.",
  "PASSENGER_NOT_FOUND": "Passager non trouvé ou bloqué précédemment.",
  "PASSENGER_REGISTER_ERROR": "Une erreur s'est produite lors de l'inscription du passager. Veuillez réessayer ou contactez notre équipe de support pour obtenir de l'aide.",
  "PASSENGER_VALIDATE_EMAIL_INVALID": "Nous regrettons de vous informer que l'adresse e-mail que vous avez essayé de vous inscrire est déjà associée à un compte existant. Veuillez choisir une adresse e-mail différente pour poursuivre le processus d'inscription.",
  "PASSENGER_FORGOT_PASS_SESSION_INVALID": "Veuillez lancer une nouvelle session de récupération de mot de passe.",
  "PASSENGER_FORGOT_PASS_OTP_NOT_EMPTY": "Veuillez fournir un OTP valide pour la récupération de mot de passe.",
  "PASSENGER_FORGOT_PASS_OTP_INVALID": "Veuillez fournir un OTP valide pour la récupération de mot de passe.",
  "PASSENGER_NEW_PW_INVALID": "Le nouveau mot de passe est invalide. Le nouveau mot de passe doit être différent de l'ancien mot de passe.",
  "COMPANY_NOT_FOUND": "Entreprise non trouvée. Veuillez vérifier les informations fournies.",
  "COMPANY_UPDATE_ERROR": "Erreur de mise à jour de l'entreprise. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide.",
  "COMPANY_DOMAIN_IS_NOT_EXIST": "Le domaine de l'entreprise n'existe pas. Veuillez vous assurer que le domaine fourni est correct.",
  "RBAC_COMPANY_PASSWORD_ERROR": "Une erreur s'est produite lors de la mise à jour du mot de passe de l'entreprise. Veuillez réessayer ou contactez notre équipe de support pour obtenir de l'aide.",
  "RBAC_ACCOUNT_NOT_FOUND": "Veuillez fournir une adresse e-mail valide pour la vérification.",
  "RBAC_FORGOT_PASS_SESSION_INVALID": "Veuillez lancer une nouvelle session de récupération de mot de passe.",
  "RBAC_FORGOT_PASS_OTP_NOT_EMPTY": "Veuillez fournir un OTP valide pour la récupération de mot de passe.",
  "RBAC_FORGOT_PASS_OTP_INVALID": "Veuillez fournir un OTP valide pour la récupération de mot de passe.",
  "RBAC_NEW_PW_INVALID": "Le nouveau mot de passe est invalide. Le nouveau mot de passe doit être différent de l'ancien mot de passe.",
  "SUBSCRIPTION_NOT_FOUND": "Abonnement introuvable. Veuillez vérifier les informations fournies.",
  "SUBSCRIPTION_PLAN_NOT_FOUND": "Plan d'abonnement introuvable. Veuillez vérifier les détails du plan.",
  "SUBSCRIPTION_NOT_ALLOW_UPDATED": "Mise à jour de l'abonnement non autorisée. Veuillez contacter le support pour obtenir de l'aide.",
  "SUBSCRIPTION_EXPIRED": "Abonnement expiré : Veuillez renouveler pour continuer à accéder à nos services. Contactez le support pour obtenir de l'aide.",
  "SUBSCRIPTION_UPDATE_PAYMENT_ID_ERROR": "Erreur de mise à jour de l'ID de paiement pour l'abonnement. Veuillez vérifier l'ID de paiement fourni et réessayer.",
  "SUBSCRIPTION_NEED_UPDATE_PLAN": "Votre abonnement actuel ne permet pas d’ajouter un nouveau véhicule.",
  "ROUTE_UPDATE_PRICE_ERROR": "Échec de la mise à jour du prix du trajet. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide.",
  "ROUTE_REMOVE_ERROR": "Échec de la suppression du trajet. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide.",
  "ROUTE_UPDATE_ERROR": "Échec de la mise à jour des informations du trajet. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide.",
  "ROUTE_ONE_TRIP_NOT_FOUND": "Le trajet spécifié pour le trajet est introuvable. Veuillez vérifier si le trajet existe et si les détails fournis sont corrects.",
  "ROUTE_FROM_GT_TO_TIME": "L'heure de départ doit être antérieure à l'heure d'arrivée. Veuillez entrer des heures valides pour le trajet",
  "ROUTE_MULTI_GT_TO_TIME": "L'heure d'arrivée doit être ultérieure à l'heure de départ pour chaque arrêt sur le trajet. Veuillez entrer des heures valides",
  "ROUTE_NOT_FOUND": "Le trajet spécifié pour le trajet est introuvable. Veuillez vérifier si le trajet existe et si les détails fournis sont corrects.",
  "ROUTE_ONE_TRIP_NOT_EXACT": "Le trajet spécifié pour le trajet est introuvable. Veuillez entrer une date exacte pour le trajet et réessayer",
  "PAYMENT_PAYPAL_CREATE_ORDER_ERROR": "Une erreur s'est produite lors de la création de la commande PayPal. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "PAYMENT_PAYPAL_ORDER_NOT_FOUND": 2501,
  "PAYMENT_PAYPAL_GEN_TOKEN_ERROR": 2502,
  "PAYMENT_UPDATE_STATUS_ERROR": 2503,
  "PAYMENT_NOT_FOUND": 2504,
  "PAYMENT_CREATE_ERROR": 2505,
  "PAYMENT_PAYPAL_CREATE_PAYOUT_ERROR": 2506,
  "PAYMENT_PAYPAL_PAYOUT_NOT_FOUND": 2507,
  "PAYMENT_STRIPE_CREATE_CHECK_OUT_ERROR": "Une erreur s'est produite lors de la création de la session de paiement Stripe. Veuillez réessayer ultérieurement ou contactez le support si le problème persiste",
  "PAYMENT_STRIPE_CREATE_ACCOUNT_ERROR": 2509,
  "PAYMENT_STRIPE_CREATE_ACCOUNT_LINK_ERROR": 2510,
  "PAYMENT_STRIPE_TRANSFERS_LINK_ERROR": 2511,
  "PACKAGE_SALE_DEPARTURE_TIME_INVALID": 2600,
  "PACKAGE_SALE_POINT_INVALID": 2601,
  "PACKAGE_SALE_PACKAGE_NOT_FOUND": 2602,
  "PACKAGE_SALE_UPDATE_DELIVERY_ERROR": 2603,
  "PACKAGE_SALE_UPDATE_PAYMENT_ERROR": 2603,
  "PACKAGE_SALE_ORDER_NOT_FOUND": 2604,
  "PACKAGE_SALE_CANT_NOT_CANCEL": 2605,
  "PACKAGE_SALE_CANT_NOT_UPDATE": 2606,
  "TICKET_SALE_NOT_FOUND": "La vente de billets demandée est introuvable. Veuillez vous assurer que la vente de billets existe et que l'URL fournie est correcte",
  "TICKET_SALE_UPDATE_PAYMENT_ERROR": "Échec de la mise à jour des informations de paiement pour la vente de billets. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "TICKET_SALE_CREATE_ERROR": "Échec de la création de la vente de billets. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "TICKET_SALE_UPDATE_ERROR": "Échec de la mise à jour des informations de la vente de billets. Veuillez réessayer ultérieurement ou contactez le support pour obtenir de l'aide",
  "SERVICE_SETTING_TITLE_EXISTED": "Le titre des paramètres du service spécifié existe déjà",
  "PASSENGER_OLD_PW_INVALID": "L'ancien mot de passe n'est pas correct",
  "COMPANY_SUBCRIPTION_IS_EXPIRED": "L'abonnement de l'entreprise a expiré. Veuillez renouveler l'abonnement pour continuer",
  "COMPANY_DOMAIN_IS_EXIST": "Domaine déjà enregistré!",
  "COMPANY_EMAIL_IS_EXIST": "Nous regrettons de vous informer que l'adresse e-mail que vous avez essayé de vous inscrire est déjà associée à un compte existant. Veuillez choisir une adresse e-mail différente pour poursuivre le processus d'inscription.",
  "RBAC_OLD_PW_INVALID": "L'ancien mot de passe n'est pas correct",
  "PAYMENT_PAYPAL_CONNECT_ERROR": "2512",
  "PAYMENT_GW_NOT_CONNECTED": "2513",
  "UNKNOWN": "Une erreur s'est produite",
  "camera_accessing": "Impossible d'accéder à la caméra"
}
