{
  "HTTP_SUCCESS": 0,
  "HTTP_SERVER_ERROR": "The server encountered an internal error",
  "HTTP_REQUEST_TIMEOUT": "Network error",
  "HTTP_BAD_REQUEST": "Your browser sent a request that this server could not understand",
  "HTTP_UNAUTHORIZED": "You are not authorized",
  "HTTP_FORBIDDEN": "You don't have permission to access this resource",
  "HTTP_NOT_FOUND": "Not found",
  "HTTP_UNPROCESSABLE_ENTITY": "The server was unable to process the request",
  "HTTP_TOO_MANY_REQUESTS": "You have made too many requests in a given amount of time",
  "HTTP_BAD_GATEWAY": "The server received an invalid response from a upstream server while attempting to fulfill the request",
  "HTTP_GATEWAY_TIMEOUT": "The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server it accessed in attempting to complete the request",
  "MONGODB_DUPLICATE": "Item existed",
  "RESOURCE_UPLOAD_IMAGE_ERROR": "There was an error while uploading the image. Please try again later or contact support if the problem persists",
  "RESOURCE_UPLOAD_NOT_FOUND": "The requested resource could not be found. Please ensure that the resource exists and the provided URL is correct",
  "CONTENT_MANAGER_UPDATE_ERROR": "There was an error while updating the content. Please try again later or contact support if the problem persists",
  "CONTENT_MANAGER_NOT_FOUND": "The requested content could not be found. Please ensure that the content exists and the provided URL is correct",
  "DESTINATION_NOT_FOUND": "The requested destination could not be found. Please ensure that the destination exists and the provided URL is correct",
  "DESTINATION_UPDATE_ERROR": "There was an error while updating the destination. Please try again later or contact support if the problem persists",
  "DESTINATION_DUPLICATION": "Form is invalid, departure point can't be arrival point.",
  "STAFF_NOT_FOUND": "The requested staff member could not be found. Please ensure that the staff member exists and the provided URL is correct",
  "STAFF_FROM_GT_TO_TIME": "The 'from' time must be earlier than the 'to' time. Please enter valid times",
  "STAFF_DAYOFF_OUT_RANGE": "Selected day off is out of range. Please select a day within the valid range",
  "STAFF_MANAGER_EMAIL_DUPLICATE": "Email address already exists. Please use a different email address",
  "STAFF_MANAGER_PHONE_DUPLICATE": "Phone number already exists. Please use a different phone number",
  "STAFF_UPDATE_INFOMATION_ERROR": "Failed to update staff information. Please try again later or contact support for assistance",
  "VEHICLE_NOT_FOUND": "The requested vehicle could not be found. Please ensure that the vehicle exists and the provided URL is correct",
  "VEHICLE_UPDATE_ERROR": "Failed to update vehicle information. Please try again later or contact support for assistance",
  "VEHICLE_EVENT_NOT_FOUND": "The requested vehicle event could not be found. Please ensure that the vehicle event exists and the provided URL is correct",
  "VEHICLE_EVENT_UPDATE_ERROR": "Failed to update vehicle event information. Please try again later or contact support for assistance",
  "OFFICE_MANAGER_UPDATE_ERROR": "Failed to update office manager information. Please try again later or contact support for assistance",
  "OFFICE_MANAGER_NOT_FOUND": "The requested office could not be found. Please ensure that the office exists and the provided URL is correct",
  "OFFICE_MANAGER_EMAIL_DUPLICATE": "Sorry, the email address you provided has already been used",
  "OFFICE_MANAGER_PHONE_DUPLICATE": "Sorry, the phone number you provided has already been used",
  "PACKAGE_SETTING_MANAGER_UPDATE_ERROR": "There was an error while updating the package settings. Please try again later or contact support if the problem persists",
  "PACKAGE_SETTING_NOT_FOUND": "The requested package settings could not be found. Please ensure that the package settings exist and the provided URL is correct",
  "PACKAGE_SETTING_TITLE_EXISTED": "The specified package setting title already exists",
  "SERVICE_SETTING_MANAGER_UPDATE_ERROR": "An error occurred while attempting to update the service settings. Please try again or contact our support team for further assistance.",
  "SERVICE_SETTING_NOT_FOUND": "Service setting not found.",
  "PASSENGER_NOT_FOUND": "Passenger not found or they have been previously blocked.",
  "PASSENGER_REGISTER_ERROR": "There was an error encountered during the passenger registration process. Please try again or contact our support team for assistance.",
  "PASSENGER_VALIDATE_EMAIL_INVALID": "We regret to inform you that the email you have attempted to register is already associated with an existing account. Please choose a different email address to proceed with the registration process.",
  "PASSENGER_FORGOT_PASS_SESSION_INVALID": "Please initiate a new password recovery session.",
  "PASSENGER_FORGOT_PASS_OTP_NOT_EMPTY": "Please provide a valid OTP for password recovery.",
  "PASSENGER_FORGOT_PASS_OTP_INVALID": "Please provide a valid OTP for password recovery.",
  "PASSENGER_NEW_PW_INVALID": "New password is invalid. New password must be different from the old password.",
  "COMPANY_NOT_FOUND": "Company not found. Please verify the information provided.",
  "COMPANY_UPDATE_ERROR": "Error updating company. Please try again later or contact support for assistance.",
  "COMPANY_DOMAIN_IS_NOT_EXIST": "Company domain does not exist. Please ensure that the provided domain is correct.",
  "RBAC_COMPANY_PASSWORD_ERROR": "There was an error encountered while attempting to update the company password. Please try again or contact our support team for assistance.",
  "RBAC_ACCOUNT_NOT_FOUND": "Please provide a valid email address for verification.",
  "RBAC_FORGOT_PASS_SESSION_INVALID": "Please initiate a new password recovery session.",
  "RBAC_FORGOT_PASS_OTP_NOT_EMPTY": "Please provide a valid OTP for password recovery.",
  "RBAC_FORGOT_PASS_OTP_INVALID": "Please provide a valid OTP for password recovery.",
  "RBAC_NEW_PW_INVALID": "New password is invalid. New password must be different from the old password.",
  "SUBSCRIPTION_NOT_FOUND": "Subscription not found. Please check the information provided.",
  "SUBSCRIPTION_PLAN_NOT_FOUND": "Subscription plan not found. Please verify the plan details.",
  "SUBSCRIPTION_NOT_ALLOW_UPDATED": "Subscription update not allowed. Please contact support for further assistance.",
  "SUBSCRIPTION_EXPIRED": "Subscription Expired: Please renew to continue accessing our services. Contact support for assistance",
  "SUBSCRIPTION_UPDATE_PAYMENT_ID_ERROR": "Error updating payment ID for subscription. Please check the provided payment ID and try again.",
  "SUBSCRIPTION_NEED_UPDATE_PLAN": "Your subscription requires an update to continue.",
  "ROUTE_UPDATE_PRICE_ERROR": "Failed to update the price for the route. Please try again later or contact support for assistance.",
  "ROUTE_REMOVE_ERROR": "Failed to remove the route. Please try again later or contact support for assistance.",
  "ROUTE_UPDATE_ERROR": "Failed to update the route information. Please try again later or contact support for assistance.",
  "ROUTE_DURATION_MUST_BE_ASC": "Stop points duration must be ascending.",
  "ROUTE_ONE_TRIP_NOT_FOUND": "The specified trip for the route could not be found. Please verify that the trip exists and the provided details are correct.",
  "ROUTE_FROM_GT_TO_TIME": "The 'from' time must be earlier than the 'to' time. Please enter valid times for the route",
  "ROUTE_MULTI_GT_TO_TIME": "The 'to' time must be later than the 'from' time for each stop on the route. Please enter valid times",
  "ROUTE_NOT_FOUND": "The specified trip for the route could not be found. Please verify that the trip exists and the provided details are correct.",
  "ROUTE_ONE_TRIP_NOT_EXACT": "The trip for the specified route could not be found. Please enter an exact date for the trip and try again",
  "PAYMENT_PAYPAL_CREATE_ORDER_ERROR": "There was an error while creating the PayPal order. Please try again later or contact support if the problem persists",
  "PAYMENT_PAYPAL_ORDER_NOT_FOUND": 2501,
  "PAYMENT_PAYPAL_GEN_TOKEN_ERROR": 2502,
  "PAYMENT_UPDATE_STATUS_ERROR": 2503,
  "PAYMENT_NOT_FOUND": 2504,
  "PAYMENT_CREATE_ERROR": 2505,
  "PAYMENT_PAYPAL_CREATE_PAYOUT_ERROR": 2506,
  "PAYMENT_PAYPAL_PAYOUT_NOT_FOUND": 2507,
  "PAYMENT_STRIPE_CREATE_CHECK_OUT_ERROR": "There was an error while creating the Stripe checkout session. Please try again later or contact support if the problem persists",
  "PAYMENT_STRIPE_CREATE_ACCOUNT_ERROR": 2509,
  "PAYMENT_STRIPE_CREATE_ACCOUNT_LINK_ERROR": 2510,
  "PAYMENT_STRIPE_TRANSFERS_LINK_ERROR": 2511,
  "PACKAGE_SALE_DEPARTURE_TIME_INVALID": 2600,
  "PACKAGE_SALE_POINT_INVALID": 2601,
  "PACKAGE_SALE_PACKAGE_NOT_FOUND": 2602,
  "PACKAGE_SALE_UPDATE_DELIVERY_ERROR": 2603,
  "PACKAGE_SALE_UPDATE_PAYMENT_ERROR": 2603,
  "PACKAGE_SALE_ORDER_NOT_FOUND": 2604,
  "PACKAGE_SALE_CANT_NOT_CANCEL": 2605,
  "PACKAGE_SALE_CANT_NOT_UPDATE": 2606,
  "TICKET_SALE_NOT_FOUND": "The requested ticket sale could not be found. Please ensure that the ticket sale exists and the provided URL is correct",
  "TICKET_SALE_UPDATE_PAYMENT_ERROR": "Failed to update the payment information for the ticket sale. Please try again later or contact support for assistance",
  "TICKET_SALE_CREATE_ERROR": "Failed to create the ticket sale. Please try again later or contact support for assistance",
  "TICKET_SALE_UPDATE_ERROR": "Failed to update the ticket sale information. Please try again later or contact support for assistance",
  "SERVICE_SETTING_TITLE_EXISTED": "The specified service setting title already exists",
  "PASSENGER_OLD_PW_INVALID": "Old password is not correct",
  "COMPANY_SUBCRIPTION_IS_EXPIRED": "The company's subscription has expired. Please renew subscription to continue",
  "COMPANY_DOMAIN_IS_EXIST": "Domain already registered!",
  "COMPANY_EMAIL_IS_EXIST": "We regret to inform you that the email you have attempted to register is already associated with an existing account. Please choose a different email address to proceed with the registration process.",
  "RBAC_OLD_PW_INVALID": "Old password is not correct",
  "PAYMENT_PAYPAL_CONNECT_ERROR": "2512",
  "PAYMENT_GW_NOT_CONNECTED": "2513",
  "UNKNOWN": "Something went wrong",
  "camera_accessing": "Can't access the camera"
}
