{
  "HTTP_SUCCESS": 0,
  "HTTP_SERVER_ERROR": "The server encountered an internal error",
  "HTTP_REQUEST_TIMEOUT": "Network error",
  "HTTP_BAD_REQUEST": "Your browser sent a request that this server could not understand",
  "HTTP_UNAUTHORIZED": "You are not authorized",
  "HTTP_FORBIDDEN": "You don't have permission to access this resource",
  "HTTP_NOT_FOUND": "Not found",
  "HTTP_UNPROCESSABLE_ENTITY": "The server was unable to process the request",
  "HTTP_TOO_MANY_REQUESTS": "You have made too many requests in a given amount of time",
  "HTTP_BAD_GATEWAY": "The server received an invalid response from a upstream server while attempting to fulfill the request",
  "HTTP_GATEWAY_TIMEOUT": "The server, while acting as a gateway or proxy, did not receive a timely response from the upstream server it accessed in attempting to complete the request",
  "MONGODB_DUPLICATE": "Item existed",
  "RESOURCE_UPLOAD_IMAGE_ERROR": "There was an error while uploading the image. Please try again later or contact support if the problem persists",
  "RESOURCE_UPLOAD_NOT_FOUND": "The requested resource could not be found. Please ensure that the resource exists and the provided URL is correct",
  "CONTENT_MANAGER_UPDATE_ERROR": "There was an error while updating the content. Please try again later or contact support if the problem persists",
  "CONTENT_MANAGER_NOT_FOUND": "The requested content could not be found. Please ensure that the content exists and the provided URL is correct",
  "DESTINATION_NOT_FOUND": "The requested destination could not be found. Please ensure that the destination exists and the provided URL is correct",
  "DESTINATION_UPDATE_ERROR": "There was an error while updating the destination. Please try again later or contact support if the problem persists",
  "STAFF_NOT_FOUND": "The requested staff member could not be found. Please ensure that the staff member exists and the provided URL is correct",
  "STAFF_FROM_GT_TO_TIME": "The 'from' time must be earlier than the 'to' time. Please enter valid times",
  "STAFF_DAYOFF_OUT_RANGE": "Selected day off is out of range. Please select a day within the valid range",
  "STAFF_MANAGER_EMAIL_DUPLICATE": "Email address already exists. Please use a different email address",
  "STAFF_MANAGER_PHONE_DUPLICATE": "Phone number already exists. Please use a different phone number",
  "STAFF_UPDATE_INFOMATION_ERROR": "Failed to update staff information. Please try again later or contact support for assistance",
  "VEHICLE_NOT_FOUND": "The requested vehicle could not be found. Please ensure that the vehicle exists and the provided URL is correct",
  "VEHICLE_UPDATE_ERROR": "Failed to update vehicle information. Please try again later or contact support for assistance",
  "VEHICLE_EVENT_NOT_FOUND": "The requested vehicle event could not be found. Please ensure that the vehicle event exists and the provided URL is correct",
  "VEHICLE_EVENT_UPDATE_ERROR": "Failed to update vehicle event information. Please try again later or contact support for assistance",
  "OFFICE_MANAGER_UPDATE_ERROR": "Failed to update office manager information. Please try again later or contact support for assistance",
  "OFFICE_MANAGER_NOT_FOUND": "The requested office could not be found. Please ensure that the office exists and the provided URL is correct",
  "OFFICE_MANAGER_EMAIL_DUPLICATE": "Sorry, the email address you provided has already been used",
  "OFFICE_MANAGER_PHONE_DUPLICATE": "Sorry, the phone number you provided has already been used",
  "PACKAGE_SETTING_MANAGER_UPDATE_ERROR": "There was an error while updating the package settings. Please try again later or contact support if the problem persists",
  "PACKAGE_SETTING_NOT_FOUND": "The requested package settings could not be found. Please ensure that the package settings exist and the provided URL is correct",
  "SERVICE_SETTING_MANAGER_UPDATE_ERROR": 1900,
  "SERVICE_SETTING_NOT_FOUND": 1901,
  "PASSENGER_NOT_FOUND": "Passenger not found or they have been previously blocked.",
  "PASSENGER_REGISTER_ERROR": 2001,
  "PASSENGER_VALIDATE_EMAIL_INVALID": 2002,
  "PASSENGER_FORGOT_PASS_SESSION_INVALID": 2003,
  "PASSENGER_FORGOT_PASS_OTP_NOT_EMPTY": 2004,
  "PASSENGER_FORGOT_PASS_OTP_INVALID": 2005,
  "COMPANY_NOT_FOUND": 2100,
  "COMPANY_UPDATE_ERROR": 2101,
  "RBAC_COMPANY_PASSWORD_ERROR": 2200,
  "RBAC_ACCOUNT_NOT_FOUND": 2201,
  "RBAC_FORGOT_PASS_SESSION_INVALID": 2202,
  "RBAC_FORGOT_PASS_OTP_NOT_EMPTY": 2203,
  "RBAC_FORGOT_PASS_OTP_INVALID": 2204,
  "SUBSCRIPTION_NOT_FOUND": 2300,
  "SUBSCRIPTION_PLAN_NOT_FOUND": 2301,
  "SUBSCRIPTION_NOT_ALLOW_UPDATED": 2302,
  "SUBSCRIPTION_EXPIRED": 2303,
  "SUBSCRIPTION_UPDATE_PAYMENT_ID_ERROR": 2304,
  "ROUTE_ONE_TRIP_NOT_FOUND": 2400,
  "ROUTE_FROM_GT_TO_TIME": 2401,
  "ROUTE_MULTI_GT_TO_TIME": 2402,
  "ROUTE_NOT_FOUND": 2403,
  "ROUTE_ONE_TRIP_NOT_EXACT": 2404,
  "PAYMENT_PAYPAL_CREATE_ORDER_ERROR": "There was an error while creating the PayPal order. Please try again later or contact support if the problem persists",
  "PAYMENT_PAYPAL_ORDER_NOT_FOUND": 2501,
  "PAYMENT_PAYPAL_GEN_TOKEN_ERROR": 2502,
  "PAYMENT_UPDATE_STATUS_ERROR": 2503,
  "PAYMENT_NOT_FOUND": 2504,
  "PAYMENT_CREATE_ERROR": 2505,
  "PAYMENT_PAYPAL_CREATE_PAYOUT_ERROR": 2506,
  "PAYMENT_PAYPAL_PAYOUT_NOT_FOUND": 2507,
  "PAYMENT_STRIPE_CREATE_CHECK_OUT_ERROR": "There was an error while creating the Stripe checkout session. Please try again later or contact support if the problem persists",
  "PAYMENT_STRIPE_CREATE_ACCOUNT_ERROR": 2509,
  "PAYMENT_STRIPE_CREATE_ACCOUNT_LINK_ERROR": 2510,
  "PAYMENT_STRIPE_TRANSFERS_LINK_ERROR": 2511,
  "PACKAGE_SALE_DEPARTURE_TIME_INVALID": 2600,
  "PACKAGE_SALE_POINT_INVALID": 2601,
  "PACKAGE_SALE_PACKAGE_NOT_FOUND": 2602,
  "PACKAGE_SALE_UPDATE_PAYMENT_ERROR": 2603,
  "PACKAGE_SALE_ORDER_NOT_FOUND": 2604,
  "TICKET_SALE_NOT_FOUND": "The requested ticket sale could not be found. Please ensure that the ticket sale exists and the provided URL is correct",
  "TICKET_SALE_UPDATE_PAYMENT_ERROR": 2701,
  "TICKET_SALE_CREATE_ERROR": 2702,
  "UNKNOWN": "Something went wrong"
}
